app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 5], ["body", "Here's a comment"], ["created_at", 2017-02-22 12:05:35 UTC], ["updated_at", 2017-02-22 12:05:35 UTC]]
---
  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save